app/views/signup/success.html.erb

		<p style="color:rgb(58,58,58);font-size:16px;margin-bottom:20px;"><a href="mailto:meekthegreek@gmail.com"></a>
		<h3 style="color:rgb(58,58,58);padding-bottom:10px;"><%= 150-User.count %> invites available&mdash;tell your friends:</h3>
---
SELECT COUNT(*) FROM "users"