app/controllers/events_controller.rb

  def index
    @events = Event.order("start DESC")
    @organized = Event.where(:organizer_id => current_user).order("start ASC")
    @joined = Event.order("start ASC")
    @open = Event.where(:status => "open").order("start ASC")
    @full = Event.where(:status => "full").order("start ASC")
    @ended = Event.where(:status => "ended").order("start DESC")
    @all_events = Event.find(:all)
    @all_events.each do |e|
---
SELECT "events".* FROM "events" ORDER BY start ASC
SELECT "events".* FROM "events" WHERE "events"."organizer_id" = 1 ORDER BY start ASC
SELECT "events".* FROM "events" WHERE "events"."status" = 'open' ORDER BY start ASC
SELECT "events".* FROM "events"

  def create
    @event = Event.new(params[:event])
    @event.validate_year(params)
    @event.save
---
INSERT INTO "events" ("created_at", "field_type", "league", "location", "needed", "note", "organizer_id", "skill_level", "start", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @event = Event.find(params[:id])
    @event.needed = params[:needed]
    @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "events" SET "location" = 'Silver Terrace Playground', "league" = 'SF Co-ed Rec Soccer', "field_type" = 'Hardcourt', "start" = '2015-03-28 07:45:00.000000', "updated_at" = '2014-03-28 21:12:48.137081' WHERE "events"."id" = 1

  def show
    @event = Event.find(params[:id])
    @comments = @event.comment_threads.order('created_at asc')
    @new_comment = Comment.build_from(@event, current_user, "")
    organizer_id = @event.organizer
    @organizer = User.find(organizer_id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1